Repository: wp-spaghetti/upload-field-to-youtube-for-acf
Catalog: upload-field-to-youtube-for-acf/languages/upload-field-to-youtube-for-acf-*.po
Languages: it_it

source: %1$s plugin is required.
it_it: È richiesto il plugin %1$s .

source: Upload Field to YouTube for ACF is a WordPress plugin that allows you to upload videos directly to YouTube via API from the WordPress admin area and/or select existing videos on your YouTube channel based on playlists.
it_it: Upload Field to YouTube for ACF è un plugin di WordPress che consente di caricare video direttamente su YouTube tramite API dall'area di amministrazione di WordPress e/o di selezionare video esistenti sul tuo canale YouTube in base alle playlist.

source: Attention
it_it: Attenzione

source: Before uploading your video, make sure you:
it_it: Prima di caricare il tuo video, assicurati di:

source: Confirm Video ID
it_it: Conferma ID video

source: Do NOT save the post until you have entered the Video ID, otherwise the video will not be associated with this post
it_it: Non salvate il post prima di aver inserito l'ID video, altrimenti il video non sarà associato a questo post.

source: Enter a "%s"
it_it: Inserisci un "%s"

source: Description
it_it: Descrizione

source: Title
it_it: Titolo

source: Enter Video ID manually
it_it: Inserire manualmente l'ID video

source: Error while uploading
it_it: Errore nel caricamento

source: The following error occurred:
it_it: Si è verificato l'errore seguente:

source: You can find the Video ID in your YouTube Studio. Go to your channel, find the uploaded video, and copy the 11-character ID from the URL or video details
it_it: Puoi trovare l'ID video nel tuo YouTube Studio. Vai al tuo canale, trova il video caricato e copia l'ID di 11 caratteri dall'URL o dai dettagli del video

source: Network error
it_it: Errore di rete

source: Network error while uploading
it_it: Errore di rete durante il caricamento

source: You can now safely save the post. The video is properly associated
it_it: Ora puoi salvare il post in sicurezza. Il video è associato correttamente

source: Parse error
it_it: Errore di analisi

source: Please enter a valid Video ID
it_it: Inserisci un ID video valido

source: Preparing to upload your file
it_it: Preparazione al caricamento del file

source: It is recommended to save the post by clicking the "Publish" button
it_it: Si consiglia di salvare il post cliccando sul pulsante "Pubblica"

source: select
it_it: seleziona

source: Select a "%s"
it_it: Seleziona un "%s"

source: Video file
it_it: File video

source: Status error
it_it: Errore di stato

source: There was a technical problem, please try again later
it_it: Si è verificato un problema tecnico, riprova più tardi

source: Upload aborted
it_it: Upload interrotto

source: Upload completed successfully
it_it: Upload completato con successo

source: Upload failed
it_it: Upload fallito

source: Video uploaded - Manual ID entry required
it_it: Video caricato - È necessario l'inserimento manuale dell'ID

source: Verifying
it_it: Verifica in corso

source: Video successfully associated with this post
it_it: Video associato correttamente a questo post

source: The Video ID is an 11-character string like: %s
it_it: Il Video ID è una stringa di 11 caratteri come: %s

source: You can find it in YouTube Studio or in the video URL after "v=" or "youtu.be/"
it_it: Puoi trovarlo su YouTube Studio o nell'URL del video dopo "v=" o "youtu.be/"

source: e.g., %s
it_it: es. %s

source: Video ID set successfully
it_it: ID video impostato con successo

source: Your video was uploaded successfully to YouTube! However, we could not automatically retrieve the Video ID due to a technical limitation
it_it: Il tuo video è stato caricato correttamente su YouTube! Tuttavia, non siamo riusciti a recuperare automaticamente l'ID video a causa di una limitazione tecnica

source: Video uploaded successfully
it_it: Video caricato con successo

source: Wait please
it_it: Attendere prego

source: Successfully logged out from YouTube.
it_it: Disconnesso con successo da YouTube.

source: Security check failed
it_it: Controllo di sicurezza fallito

source: Insufficient permissions
it_it: Permessi insufficienti

source: Plugin settings saved successfully
it_it: Impostazioni del plugin salvate con successo

source: Settings saved successfully.
it_it: Impostazioni salvate con successo.

source: Authorize App
it_it: Autorizza l'applicazione

source: Category ID
it_it: ID Categoria

source: Default: %1$s
it_it: Predefinito: %1$s

source: Privacy status
it_it: Stato della privacy

source: Unlisted
it_it: Non in elenco

source: Private
it_it: Privato

source: Public
it_it: Pubblico

source: Made for kids
it_it: Realizzato per i bambini

source: Yes
it_it: Si

source: Allow upload
it_it: Consenti upload

source: Allow select
it_it: Consenti selezione

source: Update YouTube video on post update
it_it: Aggiorna il video di YouTube dopo l'aggiornamento del post

source: Delete YouTube video on post delete
it_it: Elimina il video di YouTube dopo l'eliminazione del post

source: Select from channel
it_it: Seleziona dal canale

source: No playlists available
it_it: Nessuna playlist disponibile

source: You are not logged in
it_it: Non hai effettuato l'accesso

source: Empty field "%1$s"
it_it: Campo vuoto "%1$s"

source: This video is not associated with your authorized YouTube account
it_it: Questo video non è associato al tuo account YouTube autorizzato

source: Logout from YouTube
it_it: Logout da YouTube

source: Save Settings
it_it: Salva Impostazioni

source: Unable to retrieve field "%1$s"
it_it: Impossibile recuperare il campo "%1$s"

source: No video file uploaded
it_it: Nessun file video caricato

source: WordPress file handling functions not available
it_it: Le funzioni di gestione dei file di WordPress non sono disponibili

source: Upload error occurred
it_it: Si è verificato un errore di caricamento

source: Missing required parameters
it_it: Parametri necessari mancanti

source: Could not find recently uploaded video
it_it: Impossibile trovare il video caricato di recente

source: Video ID found and saved
it_it: ID video trovato e salvato

source: Unable to retrieve videos by playlist ID "%1$s"
it_it: Impossibile recuperare i video tramite l'ID playlist "%1$s"

source: Insufficient permissions to save video "%1$s"
it_it: Autorizzazioni insufficienti per salvare il video "%1$s"

source: Unable to save video
it_it: Impossibile salvare il video

source: Failed to initialize Google Client
it_it: Impossibile inizializzare Google Client

source: Token format validation failed
it_it: Convalida del formato token fallita

source: New token format validation failed
it_it: Convalida del nuovo formato token fallita

source: Unable to retrieve "%1$s"
it_it: Impossibile recuperare "%1$s"

source: App not authorized, contact your system administrator.
it_it: App non autorizzata, contattare l'amministratore di sistema.

source: App authorized! You can now upload videos to YouTube.
it_it: App autorizzata! Ora puoi caricare video su YouTube.

source: Authorize the app to upload videos to YouTube:
it_it: Autorizza l'app a caricare video su YouTube:

source: Google Client not available
it_it: Google Client non disponibile

source: App authorized! You are logged in as: %1$s
it_it: App autorizzata! Hai effettuato l'accesso come: %1$s

source: YouTube API returned error code: %1$d
it_it: L'API YouTube ha restituito il codice di errore: %1$d

source: Unable to retrieve "%1$s" from Google API response
it_it: Impossibile recuperare "%1$s" dalla risposta di Google API

source: Invalid file data provided
it_it: Dati del file forniti non validi

source: Invalid file size
it_it: Dimensione file non valida

source: Could not read uploaded file
it_it: Impossibile leggere il file caricato

source: Error reading file chunk
it_it: Errore nella lettura del file chunk

source: Upload completed but no video ID returned
it_it: Caricamento completato ma nessun ID video restituito

source: Upload exceeded maximum chunk limit
it_it: Il caricamento ha superato il limite massimo di chunk

source: Upload loop completed but video ID not found
it_it: Ciclo di caricamento completato ma ID video non trovato

source: Video updated successfully
it_it: Video aggiornato con successo

source: Video deleted successfully
it_it: Video eliminato con successo

source: Post title is required
it_it: Il titolo del post è obbligatorio

source: Invalid privacy status "%1$s"
it_it: Stato della privacy non valido "%1$s"

source: No valid access token available
it_it: Nessun token di accesso valido disponibile
